{
  "freelancerProjectHistory": [
    {
      "projectId": 1,
      "image": "/images/universal-pain.webp",
      "imageAlt": "universal pain management screen shot picture",
      "projectTitle": "Universal Pain Management",
      "clientName": "Universal Pain Management",
      "description": "Developed an informative website for a pain clinic aimed at helping patients understand the services and treatments offered. The website includes comprehensive information on various pain management options, and a user-friendly interface to facilitate easy navigation and access to resources. Additionally, the website supports accessibility features to ensure it is usable by all patients, including those with disabilities.",
      "technologiesUsed": ["Parcel.js", "JavaScript", "Tailwind.css", "HTML"],
      "startDate": "",
      "endDate": "",
      "highlights": [
        "Add  comprehensive library of educational resources including videos with full explanation on pain management and treatment options.(ViewMedica)",
        "Mobile first design",
        "Optimized website for SEO, and accessability and performance."
      ],
      "liveView": "https://www.universalpain.com/",
      "codeView": "https://github.com/KickButtowski80/universal-pain",
      "privateRepo": true
    },
    {
      "projectId": 5,
      "image": "/images/salud-clinical.webp",
      "imageAlt": "Salud Clinical Solutions website screenshot",
      "projectTitle": "Salud Clinical Solutions",
      "clientName": "Salud Clinical Solutions",
      "description": "Connecting Behavioral and Mental Health providers with the roles that matter most. We specialize in behavioral and mental health locum tenens across California. From major metro areas to underserved communities, our team can help clinicians find the right fit. The website features a modern, professional design that effectively communicates their healthcare staffing services and helps clinicians find the right behavioral health roles quickly. The platform provides comprehensive resources for healthcare professionals seeking locum tenens opportunities, with detailed information about available positions, requirements, and the application process. The site emphasizes Salud Clinical's commitment to quality healthcare staffing and their expertise in matching qualified clinicians with appropriate healthcare facilities throughout California.",
      "technologiesUsed": ["Parcel.js", "HTML", "CSS", "JavaScript"],
      "startDate": "",
      "endDate": "",
      "highlights": [
        "Professional healthcare staffing website design",
        "Mobile-responsive layout for healthcare professionals",
        "Optimized for search engines and accessibility",
        "Clean, modern UI focused on user experience"
      ],
      "liveView": "https://saludclinical.com/",
      "codeView": "",
      "privateRepo": true
    },
    {
      "projectId": 3,
      "image": "/images/cicceropizza-hero.webp",
      "imageAlt": "slice of pizza was lift off from the plate",
      "projectTitle": "Cicero Pizza",
      "clientName": "Cicero Pizza",
      "description": "Cicero Pizzeria is a dynamic and user-friendly web application that offers a seamless online pizza ordering experience. Built with modern web technologies, the website showcases a clean and intuitive interface that makes navigation effortless. The project demonstrates proficiency in js for frontend development and Tailwind CSS for responsive and modern design. The website features an interactive menu, secure online payment system, and a user-friendly order tracking feature. It stands as a testament to my ability to create engaging, efficient, and scalable web applications",
      "technologiesUsed": ["Parcel.js", "JavaScript", "Tailwind.css", "HTML"],
      "startDate": "",
      "endDate": "",
      "highlights": [
        "Designed a modern, responsive layout compatible with all devices.",
        "Integrated contact form with backend email service.",
        "Implemented interactive hero section illustration with animated elements.",
        "Achieved high scores in Lighthouse audits for performance and accessibility."
      ],
      "liveView": "https://cicero-pizzeria.vercel.app/",
      "codeView": "https://github.com/KickButtowski80/cicero-pizzeria",
      "privateRepo": false
    },
    {
      "projectId": 4,
      "image": "/images/jane-doe-portfolio.webp",
      "imageAlt": "Jane Doe Portfolio workspace illustration and some info about her work experience and skills",
      "projectTitle": "Jane Doe Portfolio",
      "clientName": "Jane Doe",
      "description": "The website is Jane Doe's professional portfolio, showcasing her 2 years of experience as a full-stack developer. It features an interactive workspace illustration with animated elements, a dark mode toggle, and responsive navigation. The site highlights her skills in HTML, CSS, JavaScript, Java, Node.js, and SVG through visually appealing cards, and showcases her project experience with IBM Cloud and Watson Services. With sections like About Me, Skills, Projects, and Recommendations, the portfolio emphasizes accessibility and user experience, including skip links and ARIA labels, reflecting her commitment to web development best practices.",
      "technologiesUsed": ["HTML", "CSS", "JavaScript", "firebase.js"],
      "startDate": "",
      "endDate": "",
      "highlights": [
        "Designed a modern, responsive layout compatible with all devices.",
        "Implemented interactive workspace illustration with animated elements.",
        "Integrated recommendation form with backend abilities.",
        "Achieved high scores in Lighthouse audits for performance and accessibility."
      ],
      "liveView": "https://portfolio-it-rouge.vercel.app/",
      "codeView": "https://github.com/KickButtowski80/portfolio-coursera",
      "privateRepo": false
    },
    {
      "projectId": 2,
      "image": "/images/acme-rocket.webp",
      "imageAlt": "Acme Rocket screen shot picture",
      "projectTitle": "Acme Rocket",
      "clientName": "Acme Rocket",
      "description": "Developed an informative static website for a imaginary rocket company aimed at helping its customer to  understand the services and types of rockets are offered.They're building rockets for the next century today. From the moon to Mars, Jupiter and beyond ...🚀 Think Acme Rockets. The website includes comprehensive information on various rocket models, and a user-friendly interface to facilitate easy navigation and access to resources of the company.",
      "technologiesUsed": ["Vue 3.js", "JavaScript", "Tailwind.css", "HTML"],
      "startDate": "",
      "endDate": "",
      "highlights": [
        "Add animation to enhance user experience by make pages more dynamic and engaging",
        "Mobile first design",
        "Optimized website accessability and performance."
      ],
      "liveView": "https://acme-rockets-eight.vercel.app/#hero",
      "codeView": "https://github.com/KickButtowski80/acme-rockets",
      "privateRepo": false
    }
  ]
}
