{
  "freelancerProjectHistory": [
    {
      "projectId": 1,
      "image": "src/assets/images/universal-pain.webp",
      "projectTitle": "Universal Pain Management",
      "clientName": "Universal Pain Management",
      "description": "Developed an informative website for a pain clinic aimed at helping patients understand the services and treatments offered. The website includes comprehensive information on various pain management options, and a user-friendly interface to facilitate easy navigation and access to resources. Additionally, the website supports accessibility features to ensure it is usable by all patients, including those with disabilities.",
      "technologiesUsed": ["Parcel.js", "JavaScript", "Tailwind.css"],
      "startDate": "",
      "endDate": "",
      "highlights": [
        "Add  comprehensive library of educational resources including videos with full explanation on pain management and treatment options.(ViewMedica)",
        "Mobile first design",
        "Optimized website for SEO, and accessability and performance."
      ],
      "liveView": "https://www.universalpain.com/",
      "codeView": "https://github.com/KickButtowski80/universal-pain"
    },
    {
      "projectId": 2,
      "projectTitle": "Mobile App for Fitness Tracking",
      "clientName": "FitnessPro Inc.",
      "description": "Developed a cross-platform mobile app for tracking fitness activities, including running, cycling, and swimming.",
      "technologiesUsed": ["Flutter", "Dart", "Firebase", "Google Maps API"],
      "startDate": "",
      "endDate": "",
      "highlights": [
        "Integrated GPS tracking and Google Maps for route mapping.",
        "Implemented real-time data sync with Firebase.",
        "Designed user-friendly UI/UX, leading to a 4.8-star rating on app stores."
      ]
    },
    {
      "projectId": 3,
      "projectTitle": "Custom CMS Development",
      "clientName": "Digital Agency Co.",
      "description": "Developed a custom content management system (CMS) tailored to the client's specific needs, including role-based access control and a WYSIWYG editor.",
      "technologiesUsed": ["Laravel", "PHP", "MySQL", "Vue.js"],
      "startDate": "",
      "endDate": "",
      "highlights": [
        "Implemented role-based access control to manage user permissions.",
        "Developed a custom WYSIWYG editor for easy content creation.",
        "Optimized database queries, resulting in a 30% improvement in load times."
      ]
    },
    {
      "projectId": 4,
      "projectTitle": "Responsive Portfolio Website",
      "clientName": "John Doe",
      "description": "Created a responsive portfolio website for showcasing the client's work and professional experience.",
      "technologiesUsed": ["HTML", "CSS", "JavaScript", "Bootstrap"],
      "startDate": "",
      "endDate": "",
      "highlights": [
        "Designed a modern, responsive layout compatible with all devices.",
        "Integrated contact form with backend email service.",
        "Achieved high scores in Lighthouse audits for performance and accessibility."
      ]
    }
  ]
}
